IDEA StatiCa Open Model
IdeaBeamImportSettings.DesignCode Property
Compatible with IDEA StatiCa Beta 21.0 - beta
 Gets or sets the Design Code
 Namespace: IdeaRS.OpenModel.Beam
 Assembly: IdeaRS.OpenModel (in IdeaRS.OpenModel.dll) Version: 20.0.1.1 (20.0.1.1)
Syntax
public string DesignCode { get; set; }
Public Property DesignCode As String
	Get
	Set
public:
property String^ DesignCode {
	String^ get ();
	void set (String^ value);
}
Property Value
Type: String
See Also
Reference
IdeaBeamImportSettings Class
IdeaRS.OpenModel.Beam Namespace